app/controllers/api/programs_controller.rb

  def show
    @program = Program.where("id = ?", params[:id])
---
SELECT `programs`.* FROM `programs` WHERE (id = '5')