app/controllers/api/user_programs_controller.rb

  def index
    user            = get_current_user
    last_known_save = UserProgram.where(:user_id => user.id)
                                 .select(:created_at)
                                 .distinct
                                 .order("created_at DESC")
                                 .first
---
SELECT  DISTINCT `user_programs`.`created_at` FROM `user_programs` WHERE `user_programs`.`user_id` = 23  ORDER BY created_at DESC LIMIT 1

  def create
    user_programs   = params[:user_programs]
    at_timestamp    = DateTime.now #important for user_programs_controller.rb last_known_save
    user_programs.each do |user_program|
      u             = UserProgram.new
      u.user_id     = user_program[:user_id]
      u.program_id  = user_program[:program_id]
      u.display     = user_program[:display]
      u.order       = user_program[:order]
      u.token       = user_program[:token]
      u.created_at  = at_timestamp
---
INSERT INTO `user_programs` (`user_id`, `program_id`, `order`, `token`, `created_at`, `updated_at`) VALUES (23, 11, 2, 'TRynJUzAZYxk9QEMCohjAw', '2016-12-07 07:25:05', '2016-12-07 07:25:05')