app/controllers/program_controller.rb

SELECT `users`.`id` FROM `users` WHERE `users`.`email` = 'wmorgan2@wisc.edu'
SELECT  DISTINCT `user_programs`.`created_at` FROM `user_programs` WHERE `user_programs`.`user_id` = 23  ORDER BY created_at DESC LIMIT 1
---
  def index
    auth_headers = JSON.parse(cookies[:auth_headers])

    @user        = get_current_user
    @token       = auth_headers["client"]
    @id          = User.where(:email=> auth_headers["uid"]).pluck(:id)[0]
    last_save    = UserProgram.where(:user_id => @id)
                              .select(:created_at)
                              .distinct
                              .order("created_at DESC")
                              .first